Revit 2026 API

# MEPSectionVelocity Property

---

The velocity of the section.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Velocity { get; }
```
```vb
Public ReadOnly Property Velocity As Double
	Get
```
```cpp
public:
property double Velocity {
	double get ();
}
```
```fsharp
member Velocity : float with get
```

#### Property Value

Double

In one section, all section members have same velocity. Default unit is Feet per second. For Duct, unit type is UT_HVAC_Velocity. For Pipe, unit type is UT_Piping_Velocity

#### Reference

MEPSection Class

Autodesk.Revit.DB.Mechanical Namespace